{
  "APP": {
    "TITLE": "Développement Web & Mobile Sur Mesure. FrontFlow.",
    "DESCRIPTION": "FrontFlow est spécialisé dans le développement d'applications web et mobile.",
    "KEYWORDS": "creation de site, site web geneve, developpement web, interface utilisateur, experience utilisateur, ux geneve, agence web geneve, site web geneve, developpeur angular, site angular, developpement mobile cordova, developpeur cordova, developpement application web geneve"
  },
  "HEADER": {
    "LINK": {
      "SERVICES": "Notre Expertise",
      "TOOLKIT": "Nos Outils"
    }
  },
  "WELCOME": {
    "CATCHPHRASE": "Nous développons vos interfaces.",
    "WEARE": "FrontFlow est spécialisé dans le développement d'applications web et mobile."
  },
  "SERVICES": {
    "TITLE": "Notre expertise à votre service.",
    "CODE": "Avec plus de <b>15 ans d'expérience</b> en développement web, nos méthodes de travail sont sûres et nos choix toujours adaptés à vos besoins.",
    "UX": "Bien plus que des interfaces, <b>FrontFlow</b> crée des <strong>expériences utilisateurs</strong> de qualité afin de fidéliser vos visiteurs.",
    "BACKEND": "Quelque soit votre <strong>technologie back-end</strong> (PHP, Java, autres), nous définirons ensemble le meilleur moyen d'accéder à vos données.",
    "TESTING": "Nous validons nos itérations par le biais de <strong>tests unitaires</strong>. Chaque module est donc évalué plusieurs fois avant sa mise en production.",
    "DEVICE": "Tous nos développements sont <b>naturellement adaptés</b> à tous les écrans: ordinateurs de bureau, tablettes et téléphones mobiles.",
    "WORK": "La communication est essentielle, c'est pourquoi vous pouvez <b>suivre la progression</b> de votre projet sur votre <a href='login' class='link'>espace personnel</a>."
  },
  "TOOLKIT": {
    "TITLE": "Un outillage sur mesure.",
    "ANGULAR": "<strong>Angular</strong> est un framework fiable et robuste pour la création d'applications web et mobile performantes reposant sur une structure claire et maintenable.",
    "SASS": "Avec <strong>SASS</strong> pour la création des feuilles de style de votre application, la productivité et leur modification sont nettement améliorées.",
    "TYPESCRIPT": "<strong>TypeScript</strong> nous permet de produire du <strong>JavaScript</strong> propre et durable. Moins de duplication, plus de code !",
    "CORDOVA": "Nous utilisons <strong>Cordova</strong> afin de déposer votre application sur les différents stores (Google Play, AppStore & Windows Store).",
    "OTHER": "FrontFlow est une <b>agence 360°</b>. Nous maitrisons aussi bien d'autres technologies dans les domaines du <strong>back-end</strong> et de l'<strong>intégration continue</strong>."
  },
  "CONTACT": {
    "LETSTALK": "Discutons de votre projet !",
    "SUCCESS": "Merci pour votre message, nous vous répondrons dans les plus brefs délais.",
    "FORM": {
      "NAME": "Saisissez votre nom",
      "EMAIL": "Saisissez votre adresse e-mail",
      "MESSAGE": "Votre message",
      "SEND": "Discutons !",
      "ERROR": {
        "REQUIRED": "Ce champ ne peut pas être vide.",
        "EMAIL": "L'adresse saisie n'est pas valide.",
        "MINLENGTH": "Votre message doit contenir au moins {{ value }} caractères.",
        "MAXLENGTH": "Votre message est trop long (max. {{ value }} caractères)."
      }
    }
  },
  "FOOTER": {
    "PREBUILT": "Développé avec",
    "POSTBUILT": "à Genève, Suisse."
  },
  "LOGIN": {
    "TITLE": "Espace client. FrontFlow.",
    "CUSTOMER": "Espace client",
    "USER": "Utilisateur (nom ou e-mail)",
    "PASS": "Mot de passe",
    "SUBMIT": "Connexion",
    "FORGOTTEN": "Mot de passe oublié ?",
    "BACKTOLOGIN": "Retour au Login"
  },
  "BACK": "Retour au site",
  "SEND": "Envoyer"
}